; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	spectrograph1 - mode
	infrared3 - mode
	spectrograph0 - mode
	infrared2 - mode
	GroundStation0 - direction
	Star1 - direction
	Star6 - direction
	GroundStation4 - direction
	GroundStation2 - direction
	Star3 - direction
	Star7 - direction
	GroundStation5 - direction
	Star8 - direction
	Planet9 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Star12 - direction
	Phenomenon13 - direction
	Planet14 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(supports instrument0 infrared3)
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 Star7)
	(calibration_target instrument0 GroundStation4)
	(supports instrument1 spectrograph0)
	(supports instrument1 infrared2)
	(supports instrument1 infrared3)
	(calibration_target instrument1 GroundStation2)
	(supports instrument2 spectrograph1)
	(supports instrument2 infrared3)
	(supports instrument2 infrared2)
	(calibration_target instrument2 Star3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star3)
	(supports instrument3 infrared3)
	(supports instrument3 spectrograph0)
	(supports instrument3 spectrograph1)
	(calibration_target instrument3 Star7)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet10)
	(supports instrument4 infrared3)
	(supports instrument4 infrared2)
	(calibration_target instrument4 Star7)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet9)
	(supports instrument5 spectrograph1)
	(calibration_target instrument5 GroundStation5)
	(calibration_target instrument5 Star7)
	(on_board instrument5 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star6)
)
(:goal (and
	(pointing satellite1 Star1)
	(pointing satellite3 Planet14)
	(have_image Star8 spectrograph1)
	(have_image Planet9 spectrograph1)
	(have_image Planet10 spectrograph0)
	(have_image Phenomenon11 infrared3)
	(have_image Star12 infrared2)
	(have_image Phenomenon13 spectrograph1)
	(have_image Planet14 infrared3)
))

)

; plan
1. (turn_to satellite3 planet14 star6)
   deleted: (pointing satellite3 star6)
   added: (pointing satellite3 planet14)
   goals met: 1 of 9
2. (turn_to satellite1 star7 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 star7)
   goals met: 1 of 9
3. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 1 of 9
4. (calibrate satellite1 instrument3 star7)
   added: (calibrated instrument3)
   goals met: 1 of 9
5. (turn_to satellite1 phenomenon13 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 phenomenon13)
   goals met: 1 of 9
6. (take_image satellite1 phenomenon13 instrument3 spectrograph1)
   added: (have_image phenomenon13 spectrograph1)
   goals met: 2 of 9
7. (turn_to satellite1 phenomenon11 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 phenomenon11)
   goals met: 2 of 9
8. (take_image satellite1 phenomenon11 instrument3 infrared3)
   added: (have_image phenomenon11 infrared3)
   goals met: 3 of 9
9. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 3 of 9
10. (calibrate satellite0 instrument2 star3)
   added: (calibrated instrument2)
   goals met: 3 of 9
11. (turn_to satellite0 planet14 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 planet14)
   goals met: 3 of 9
12. (take_image satellite0 planet14 instrument2 infrared3)
   added: (have_image planet14 infrared3)
   goals met: 4 of 9
13. (turn_to satellite0 planet9 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 planet9)
   goals met: 4 of 9
14. (take_image satellite0 planet9 instrument2 spectrograph1)
   added: (have_image planet9 spectrograph1)
   goals met: 5 of 9
15. (turn_to satellite0 star12 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star12)
   goals met: 5 of 9
16. (take_image satellite0 star12 instrument2 infrared2)
   added: (have_image star12 infrared2)
   goals met: 6 of 9
17. (turn_to satellite0 star8 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star8)
   goals met: 6 of 9
18. (take_image satellite0 star8 instrument2 spectrograph1)
   added: (have_image star8 spectrograph1)
   goals met: 7 of 9
19. (turn_to satellite1 planet10 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 planet10)
   goals met: 7 of 9
20. (take_image satellite1 planet10 instrument3 spectrograph0)
   added: (have_image planet10 spectrograph0)
   goals met: 8 of 9
21. (turn_to satellite1 star1 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 star1)
   goals met: 9 of 9
